Repository: pingfangx/TranslatorX-other
Catalog: JavaDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: This enum provides constants of the four Unicode normalization forms that are described in Unicode Standard Annex #15 — Unicode Normalization Forms and two methods to access them.
zh_cn: 此枚举提供在 Unicode Standard Annex #15 — Unicode Normalization Forms 中描述的四个 Unicode 标准化形式的常量，以及访问这些常量的两个方法。

source: This error can be thrown by the API used to read annotations reflectively.
zh_cn: 此错误可以通过用于读取反射性注释的API 被抛出。

source: This exception can be thrown by the API used to read annotations reflectively.
zh_cn: 此异常可以通过用于读取反射性注释的API 被抛出。

source: This exception is not thrown until the lock status of this object has been restored as described above.
zh_cn: 在按上述形式恢复此对象的锁定状态时才会抛出此异常。

source: This exception is thrown by the AccessController to indicate that a requested access (to a critical system resource such as the file system or the network) is denied.
zh_cn: 此异常由 AccessController 抛出，提示请求的访问（对关键系统资源（如文件系统或网络）的访问）被拒绝。

source: This exception is thrown if a key in the keystore cannot be recovered.
zh_cn: 如果 keystore 中的密钥无法恢复，则抛出此异常。

source: This exception is thrown if an entry in the keystore cannot be recovered.
zh_cn: 如果 keystore 中的某项无法恢复，则抛出此异常。

source: This exception is thrown when a particular cryptographic algorithm is requested but is not available in the environment.
zh_cn: 当请求特定的加密算法而它在该环境中不可用时抛出此异常。

source: This exception is thrown when a particular security provider is requested but is not available in the environment.
zh_cn: 当请求特定安全性 provider 但它在该环境中不可用时抛出此异常。

source: This exception may be thrown by methods that have detected concurrent modification of an object when such modification is not permissible.
zh_cn: 当方法检测到对象的并发修改，但不允许这种修改时，抛出此异常。

source: This exception will not be thrown if the new element has a default value.
zh_cn: 如果新元素有默认值，则不抛出此异常。

source: This exception, designed for use by the JCA/JCE engine classes, is thrown when an invalid parameter is passed to a method.
zh_cn: 当将无效参数传递给某个方法时抛出此异常，设计该异常供 JCA/JCE 引擎类使用。

source: This field is used to make iterators on Collection-views of the HashMap fail-fast.
zh_cn: 该字段用于在 HashMap 的 Collection 视图的迭代上产生快速失败。

source: This file specifies various properties including name and general category for every defined Unicode code point or character range.
zh_cn: 此文件指定了各种属性，其中包括每个已定义 Unicode 代码点或字符范围的名称和常规类别。

source: This guarantees that enums are never cloned, which is necessary to preserve their "singleton" status.
zh_cn: 这可保证永远不会复制枚举，这对于保留其“单元素”状态是必需的。

source: This implementation always throws an UnsupportedOperationException.
zh_cn: 此实现始终抛出 UnsupportedOperationException。

source: This implementation calls entrySet().clear().
zh_cn: 此实现调用 entrySet().clear()。

source: This implementation iterates over entrySet() searching for an entry with the specified key.
zh_cn: 此实现在 entrySet() 上进行迭代，以搜索带有指定键的条目。

source: This implementation iterates over entrySet() searching for an entry with the specified value.
zh_cn: 此实现在 entrySet() 上进行迭代，以搜索带有指定值的条目。

source: This implementation iterates over the specified map's entrySet() collection, and calls this map's put operation once for each entry returned by the iteration.
zh_cn: 此实现在指定映射的 entrySet() collection 上进行迭代，并对迭代返回的每个条目调用一次此映射的 put 操作。

source: This implementation provides all of the optional map operations, and permits null values and the null key.
zh_cn: 此实现提供所有可选的映射操作，并允许使用 null 值和 null 键。

source: This implementation provides constant-time performance for the basic operations (get and put), assuming the hash function disperses the elements properly among the buckets.
zh_cn: 此实现假定哈希函数将元素适当地分布在各桶之间，可为基本操作（get 和 put）提供稳定的性能。

source: This implementation returns entrySet().size().
zh_cn: 此实现返回 entrySet().size()。

source: This implementation returns size() == 0.
zh_cn: 此实现返回 size() == 0。

source: This implementation returns a collection that subclasses AbstractCollection.
zh_cn: 此实现返回一个子类化 AbstractCollection 的 collection。

source: This implementation returns a set that subclasses AbstractSet.
zh_cn: 此实现返回一个子类化 AbstractSet 的 set。

source: This implementation simply returns null; if the programmer desires thread-local variables to have an initial value other than null, ThreadLocal must be subclassed, and this method overridden.
zh_cn: 该实现返回 null；如果程序员希望线程局部变量具有 null 以外的值，则必须为 ThreadLocal 创建子类，并重写此方法。

source: This in turn admits the possibility of unbounded thread growth when commands continue to arrive on average faster than they can be processed.
zh_cn: 当命令以超过队列所能处理的平均数连续到达时，此策略允许无界线程具有增长的可能性。

source: This includes classes that implement an easily configurable, fine-grained access control security architecture.
zh_cn: 包括那些实现了可方便配置的、细粒度的访问控制安全架构的类。

source: This integer need not remain consistent from one execution of an application to another execution of the same application.
zh_cn: 从某一应用程序的一次执行到同一应用程序的另一次执行，该整数无需保持一致。

source: This interface defines a factory for URL stream protocol handlers.
zh_cn: 该接口为 URL 流协议处理程序定义一个工厂。

source: This interface defines a factory for content handlers.
zh_cn: 此接口定义内容处理程序的工厂。

source: This interface defines a factory for datagram socket implementations.
zh_cn: 此接口定义用于数据报套接字实现的工厂。

source: This interface defines a factory for socket implementations.
zh_cn: 此接口定义用于套接字实现的工厂。

source: This interface defines a protocol for bidirectional iteration over text.
zh_cn: 此接口定义了对文本进行双向迭代的协议。

source: This interface does not refine the general contracts of the equals and hashCode methods.
zh_cn: 此接口不修改 equals 和 hashCode 方法的常规协定。

source: This interface imposes a total ordering on the objects of each class that implements it.
zh_cn: 此接口强行对实现它的每个类的对象进行整体排序。

source: This interface is a member of the Java Collections Framework.
zh_cn: 此接口是 Java Collections Framework 的成员。

source: This interface is designed to provide a common protocol for objects that wish to execute code while they are active.
zh_cn: 设计该接口的目的是为希望在活动时执行代码的对象提供一个公共协议。

source: This interface provides uniform, read-only access to many different kinds of char sequences.
zh_cn: 此接口对许多不同种类的 char 序列提供统一的只读访问。

source: This interface represents a guard, which is an object that is used to protect access to another object.
zh_cn: 此接口表示一个 guard，guard 是用来保护对另一个对象的访问的对象。

source: This interface represents the abstract notion of a principal, which can be used to represent any entity, such as an individual, a corporation, and a login id.
zh_cn: 此接口表示主体的抽象概念，它可以用来表示任何实体，例如，个人、公司或登录 id。

source: This interface specifies constraints for cryptographic algorithms, keys (key sizes), and other algorithm parameters.
zh_cn: 此接口指定用于加密的算法，密钥(密钥大小)，和其他算法参数约束。

source: This is a convenience constructor that sets the process builder's command to a string list containing the same strings as the command array, in the same order.
zh_cn: 这是一个有用的构造方法，它将进程生成器的命令设置为与 command 数组包含相同字符串的字符串列表，且顺序相同。

source: This is a convenience method that sets the command to a string list containing the same strings as the command array, in the same order.
zh_cn: 这是一个有用的方法，它将命令设置为与 command 数组包含相同字符串的字符串列表，且顺序相同。

source: This is best done at creation time, to prevent accidental unsynchronized access to the map:
zh_cn: 最好在创建时完成这一操作，以防止对映射进行意外的非同步访问，如下所示：

source: This is how the WeakHashMap class works.
zh_cn: 这就是 WeakHashMap 类的工作方式。

source: This is important because classes should not be subclassed unless the programmer intends on modifying or enhancing the fundamental behavior of the class.
zh_cn: 这很重要，因为除非程序员打算修改或增强类的基本行为，否则不应为该类创建子类。

source: This is messier than typical red-black deletion code because we cannot swap the contents of an interior node with a leaf successor that is pinned by "next" pointers that are accessible independently during traversal.
zh_cn: 这比典型的红黑删除代码更混乱，因为我们不能将内部节点的内容与被遍历期间独立访问的“下一个”指针固定的叶子后继替换。

source: This is so because sorted sets (and sorted maps) without explicit comparators behave "strangely" when they are used with elements (or keys) whose natural ordering is inconsistent with equals.
zh_cn: 这是因为在使用自然排序与 equals 不一致的元素（或键）时，没有显式比较器的有序集合（和有序映射表）行为表现“怪异”。

source: This is the basic key exception.
zh_cn: 此异常是基本的密钥异常。

source: This is the common base class of all Java language enumeration types.
zh_cn: 这是所有 Java 语言枚举类型的公共基本类。

source: This is the default behavior.
zh_cn: 这是默认的行为。

source: This is the exception for invalid Keys (invalid encoding, wrong length, uninitialized, etc).
zh_cn: 用于无效 Key（无效的编码、错误的长度、未初始化等）的异常。

source: This is the exception for invalid or inappropriate algorithm parameters.
zh_cn: 用于无效或不合适的算法参数的异常。

source: This is the general key management exception for all operations dealing with key management.
zh_cn: 此异常是用于所有处理密钥管理的操作的通用密钥管理异常。

source: This is the generic KeyStore exception.
zh_cn: 这是一般的 KeyStore 异常。

source: This is the generic Message Digest exception.
zh_cn: 此为一般 Message Digest 异常。

source: This is the generic Signature exception.
zh_cn: 这是一般的签名异常。

source: This is the major difference with URIs which only identify resources, and therefore don't need to have access to the protocol handler.
zh_cn: 此为与 URI 的主要不同点，URI 仅标识资源，所以不必访问协议处理程序。

source: This is typically accomplished by synchronizing on some object that naturally encapsulates the map.
zh_cn: 这一般通过对自然封装该映射的对象进行同步操作来完成。

source: This limitation exists because the corresponding method implementation in the generated proxy class cannot determine which interface it was invoked through.
zh_cn: 此限制存在的原因是，生成的代理类中的相应方法实现无法确定它通过哪一个接口调用。

source: This makes it easier to correlate error messages with the corresponding output.
zh_cn: 这使得关联错误消息和相应的输出变得更容易。

source: This map usually acts as a binned (bucketed) hash table, but when bins get too large, they are transformed into bins of TreeNodes, each structured similarly to those in java.util.TreeMap.
zh_cn: 这个映射通常充当一个 binned (分箱的)(bucketed (分桶的))哈希表，但是当 bin 变得太大时，它们会被转换成 TreeNodes (树结点) 的 bin，每个 bin 的结构与 java.util.TreeMap 中的相似。

source: This may be acceptable when, for example, updating performance statistics, but rarely otherwise.
zh_cn: 例如，在更新性能统计数据时，这也许可以接受，但其他情况几乎不可以。

source: This may be appropriate when each task is completely independent of others, so tasks cannot affect each others execution; for example, in a web page server.
zh_cn: 当每个任务完全独立于其他任务，即任务执行互不影响时，适合于使用无界队列；例如，在 Web 页服务器中。

source: This may be used for example, to represent version numbers corresponding to series of updates.
zh_cn: 例如，这可用于表示与更新系列对应的版本号。

source: This may result in a SecurityException being thrown.
zh_cn: 这可能导致抛出 SecurityException。

source: This may result in multiple invocations of the initialValue method in the current thread.
zh_cn: 这将导致在当前线程多次调用 initialValue 方法。

source: This may result in throwing a SecurityException.
zh_cn: 这可能导致抛出 SecurityException。

source: This means your main application or applet can be written to be language-independent, and it can rely upon separate, dynamically-linked localized resources.
zh_cn: 这意味着所编写的主程序或 applet 是与语言无关的，并且它可以依靠独立的、动态链接的本地化资源。

source: This meta-annotation indicates that the declared type is intended solely for use as a member type in complex annotation type declarations.
zh_cn: 此元注释指示该声明类型只可作为复杂注释类型声明中的成员类型使用。

source: This method (which varies in argument types across different classes) atomically sets a variable to the updateValue if it currently holds the expectedValue, reporting true on success.
zh_cn: 如果此方法（在不同的类间参数类型也不同）当前保持 expectedValue，则以原子方式将变量设置为 updateValue，并在成功时报告 true。

source: This method causes the current thread (call it T) to place itself in the wait set for this object and then to relinquish any and all synchronization claims on this object.
zh_cn: 此方法导致当前线程（称之为 T）将其自身放置在对象的等待集中，然后放弃此对象上的所有同步要求。

source: This method checks that the command is a valid operating system command.
zh_cn: 此方法检查 command 是否是一条有效的操作系统命令。

source: This method creates the component type of the array.
zh_cn: 此方法创建数组的组件类型。

source: This method does not make a copy of the command list.
zh_cn: 此方法不会 制作一份 command 列表的副本。

source: This method does not offer real-time guarantees: It schedules the timeout as if by invoking the wait(long) method.
zh_cn: 此方法不提供实时保证：它通过调用 wait(long) 方法来调度超时。

source: This method does not properly convert bytes into characters.
zh_cn: 该方法无法将字节正确地转换为字符。

source: This method does not properly convert characters into bytes.
zh_cn: 该方法无法将字符正确转换为字节。

source: This method exists solely for use with suspend(), which has been deprecated because it is deadlock-prone.
zh_cn: 该方法只用于在使用 suspend()，它已被弃用，因为它具有死锁倾向。

source: This method has been deprecated, as it is inherently deadlock-prone.
zh_cn: 该方法已过时，因为它具有固有的死锁倾向。

source: This method is final in order to ensure that the equals and hashCode methods will be consistent in all subclasses.
zh_cn: 此方法为 final，可确保 equals 和 hashCode 方法在所有子类中一致。

source: This method is designed primarily for convenient access to marker annotations.
zh_cn: 此方法主要是为了便于访问标记注释而设计的。

source: This method is equivalent to:
zh_cn: 此方法相当于：

source: This method is inherently deadlock-prone.
zh_cn: 此方法容易导致死锁。

source: This method is inherently unsafe.
zh_cn: 该方法具有固有的不安全性。

source: This method is invoked only by Java code; when the garbage collector clears references it does so directly, without invoking this method.
zh_cn: 只有 Java 代码才调用此方法；当垃圾回收器清除引用时，可以直接进行操作，无需调用此方法。

source: This method is invoked only by Java code; when the garbage collector enqueues references it does so directly, without invoking this method.
zh_cn: 只有 Java 代码才调用此方法；当垃圾回收器将引用加入队列时，可以直接进行操作，无需调用此方法。

source: This method is provided so that class loaders can be made to ignore any command line or persistent assertion status settings and "start with a clean slate."
zh_cn: 提供此方法的目的是使类装入器可以忽略任何命令行或持久断言状态设置和“从头开始”。

source: This method is provided so that this class can implement the CharSequence interface.
zh_cn: 提供该方法使得本类可以实现 CharSequence 接口。

source: This method is similar to the wait method of one argument, but it allows finer control over the amount of time to wait for a notification before giving up.
zh_cn: 此方法类似于一个参数的 wait 方法，但它允许更好地控制在放弃之前等待通知的时间量。

source: This method is supported for the benefit of hash tables such as those provided by HashMap.
zh_cn: 支持此方法是为了提高哈希表（例如 HashMap 提供的哈希表）的性能。

source: This method is used only for debugging.
zh_cn: 该方法仅用于调试。

source: This method is used solely in conjunction with Thread.suspend and ThreadGroup.suspend, both of which have been deprecated, as they are inherently deadlock-prone.
zh_cn: 此方法只用于联合 Thread.suspend 和 ThreadGroup.suspend 时，因为它们所固有的容易导致死锁的特性，所以两者都已废弃。

source: This method may be overridden, though it typically isn't necessary or desirable.
zh_cn: 可以重写此方法，虽然一般来说没有必要。

source: This method must be invoked before the thread is started.
zh_cn: 必须在启动线程之前调用此方法。

source: This method predates the general-purpose exception chaining facility.
zh_cn: 该方法早于通用异常链设施。

source: This method returns true if and only if this and the argument refer to the same object; since this method is final, this guarantee holds for all subclasses.
zh_cn: 当且仅当 this 和参数引用同一对象时，此方法才返回 true，由于此方法为 final，这保证了保持所有子类。

source: This method returns immediately if the subprocess has already terminated.
zh_cn: 如果已终止该子进程，此方法立即返回。

source: This method should only be called by a thread that is the owner of this object's monitor.
zh_cn: 此方法只应由作为此对象监视器的所有者的线程来调用。

source: This method synchronizes on this (the destination) object but does not synchronize on the source (sb).
zh_cn: 该方法在 this（目标）对象上实现同步，但不在源（sb）上实现同步。

source: This method synchronizes on this (the destination) object but does not synchronize on the source (s).
zh_cn: 该方法在 this（目标）对象上实现同步，但不在源（s）上实现同步。

source: This method was deprecated in API level 1.
zh_cn: 此方法在 API 级别 1 中已弃用。

source: This method was originally designed to destroy this thread without any cleanup.
zh_cn: 该方法最初用于破坏该线程，但不作任何清除。

source: This method will be invoked on an invocation handler when a method is invoked on a proxy instance that it is associated with.
zh_cn: 在与方法关联的代理实例上调用方法时，将在调用处理程序上调用此方法。

source: This method will be invoked the first time a thread accesses the variable with the get() method, unless the thread previously invoked the set(T) method, in which case the initialValue method will not be invoked for the thread.
zh_cn: 线程第一次使用 get() 方法访问变量时将调用此方法，但如果线程之前调用了 set(T) 方法，则不会对该线程再调用 initialValue 方法。

source: This method will return null in such implementations if this class loader's parent is the bootstrap class loader.
zh_cn: 如果该类由引导类加载器加载，则此方法在这类实现中将返回 null。

source: This method will return a zero-length array if this thread has not started, has started but has not yet been scheduled to run by the system, or has terminated.
zh_cn: 如果该线程尚未启动或已经终止，则该方法将返回一个零长度数组。

source: This object (which is already a string!) is itself returned.
zh_cn: 该对象(已经是一个字符串！)本身返回。

source: This ordering is referred to as the class's natural ordering, and the class's compareTo method is referred to as its natural comparison method.
zh_cn: 这种排序被称为类的自然排序，类的 compareTo 方法被称为它的自然比较方法。

source: This package also supports the generation and storage of cryptographic public key pairs, as well as a number of exportable cryptographic operations including those for message digest and signature generation.
zh_cn: 此包也支持密码公钥对的生成和存储，以及包括信息摘要和签名生成在内的可输出密码操作。

source: This package contains three main groups of classes and interfaces:
zh_cn: 此包包含类和接口的三大主要组：

source: This package includes a few small standardized extensible frameworks, as well as some classes that provide useful functionality and are otherwise tedious or difficult to implement.
zh_cn: 此包包括了几个小的、已标准化的可扩展框架，以及一些提供有用功能的类，没有这些类，这些功能会很难实现或实现起来冗长乏味。

source: This parameter can also be changed dynamically using method setKeepAliveTime(long, TimeUnit).
zh_cn: 也可以使用方法 setKeepAliveTime(long, TimeUnit) 动态地更改此参数。

source: This policy avoids lockups when handling sets of requests that might have internal dependencies.
zh_cn: 此策略可以避免在处理可能具有内部依赖性的请求集时出现锁。

source: This process will be repeated until an annotation for this type is found, or the top of the class hierarchy (Object) is reached.
zh_cn: 此过程会重复进行，直到找到此类型的注释或到达了该类层次结构的顶层 (Object) 为止。

source: This protection domain will typically be granted java.security.AllPermission.
zh_cn: 此保护域通常被授予 java.security.AllPermission。

source: This provides a means of reducing resource consumption when the pool is not being actively used.
zh_cn: 这提供了当池处于非活动状态时减少资源消耗的方法。

source: This provides a simple feedback control mechanism that will slow down the rate that new tasks are submitted.
zh_cn: 此策略提供简单的反馈控制机制，能够减缓新任务的提交速度。

source: This relaxation permits better-performing implementations where strict reproducibility is not required.
zh_cn: 此类在不需要严格重复的地方可以得到更好的执行。

source: This restriction means that not all of the exception types returned by invoking getExceptionTypes on the Method object passed to the invoke method can necessarily be thrown successfully by the invoke method.
zh_cn: 此限制表示并非所有的由传递到 invoke 方法的 Method 对象上调用 getExceptionTypes 返回的异常类型都可以由 invoke 方法成功抛出。

source: This sequence is altered to represent a new character sequence that is identical to the old character sequence, except that it contains the character ch at position index.
zh_cn: 此序列将被转换，以表示等同于原字符序列的新字符序列，唯一的不同在于新序列在 index 处包含 ch。

source: This sequence is shortened by one char.
zh_cn: 此序列将缩短一个 char。

source: This subclass should override the run method of class Thread.
zh_cn: 该子类应重写 Thread 类的 run 方法。

source: This type should be used to annotate the declarations of types whose annotations affect the use of annotated elements by their clients.
zh_cn: 应使用此类型来注释这些类型的声明：其注释会影响由其客户端注释的元素的使用。

source: This versioning information is retrieved and made available by the ClassLoader instance that loaded the class(es).
zh_cn: 通过用于加载类的 ClassLoader 实例，可以获取并获得此版本信息。

source: Thread T becomes disabled for thread scheduling purposes and lies dormant until one of four things happens:
zh_cn: 出于线程调度目的，在发生以下四种情况之一前，线程 T 被禁用，且处于休眠状态：

source: Thread T then returns from the invocation of the wait method.
zh_cn: 然后，线程 T 从 wait 方法的调用中返回。

source: Thread pools address two different problems: they usually provide improved performance when executing large numbers of asynchronous tasks, due to reduced per-task invocation overhead, and they provide a means of bounding and managing the resources, including threads, consumed when executing a collection of tasks.
zh_cn: 线程池可以解决两个不同问题：由于减少了每个任务调用的开销，它们通常可以在执行大量异步任务时提供增强的性能，并且还可以提供绑定和管理资源（包括执行任务集时使用的线程）的方法。

source: Thread safety is the responsibility of classes that extend and implement this interface.
zh_cn: 线程安全由扩展和实现此接口的类负责。

source: Thread state for a runnable thread.
zh_cn: 可运行线程的线程状态。

source: Thread state for a terminated thread.
zh_cn: 已终止线程的线程状态。

source: Thread state for a thread blocked waiting for a monitor lock.
zh_cn: 受阻塞并且正在等待监视器锁的某一线程的线程状态。

source: Thread state for a thread which has not yet started.
zh_cn: 至今尚未启动的线程的状态。

source: Thread state for a waiting thread with a specified waiting time.
zh_cn: 具有指定等待时间的某一等待线程的线程状态。

source: Thread state for a waiting thread.
zh_cn: 某一等待线程的线程状态。

source: Threads should possess the "modifyThread" RuntimePermission.
zh_cn: 线程应该有 “modifyThread”RuntimePermission。

source: Threads with higher priority are executed in preference to threads with lower priority.
zh_cn: 高优先级线程的执行优先于低优先级线程。

source: Three types of reference objects are provided, each weaker than the last: soft, weak, and phantom.
zh_cn: 有三种类型的引用对象，按从弱到强依次为： 软 引用、 弱 引用和 虚 引用。

source: Throwing null as if it were a Throwable value.
zh_cn: 将 null 作为 Throwable 值抛出。

source: Throwing a "wrapped exception" (i.e., an exception containing a cause) allows the upper layer to communicate the details of the failure to its caller without incurring either of these shortcomings.
zh_cn: 抛出“经过包装的异常”（即包含 cause 的异常）允许高层与其调用方交流失败详细信息，而不会招致上述任何一个缺点。

source: Thrown by String methods to indicate that an index is either negative or greater than the size of the string.
zh_cn: 此异常由 String 方法抛出，指示索引或者为负，或者超出字符串的大小。

source: Thrown by a Scanner to indicate that the token retrieved does not match the pattern for the expected type, or that the token is out of range for the expected type.
zh_cn: 由 Scanner 抛出，表明获取的标记与期望类型的模式不匹配，或者该标记超出期望类型的范围。

source: Thrown by a method invocation on a proxy instance if its invocation handler's invoke method throws a checked exception (a Throwable that is not assignable to RuntimeException or Error) that is not assignable to any of the exception types declared in the throws clause of the method that was invoked on the proxy instance and dispatched to the invocation handler.
zh_cn: 如果代理实例的调用处理程序的 invoke 方法抛出一个经过检查的异常（不可分配给 RuntimeException 或 Error 的 Throwable ），且该异常不可分配给该方法（在代理实例上调用该方法，并将其指派到调用处理程序）的 throws 子句中声明的任何异常类，则由代理实例上的方法调用抛出此异常。

source: Thrown by methods in Locale and Locale.Builder to indicate that an argument is not a well-formed BCP 47 tag.
zh_cn: 由方法 Locale 和 Locale.Builder 抛出以指示参数不是一个正确格式的 BCP 47 标签。

source: Thrown by methods in the Stack class to indicate that the stack is empty.
zh_cn: 该异常由 Stack 类中的方法抛出，以表明堆栈为空。

source: Thrown by the nextElement method of an Enumeration to indicate that there are no more elements in the enumeration.
zh_cn: 由 Enumeration 的 nextElement 方法抛出，表明枚举中没有更多的元素。

source: Thrown by the security manager to indicate a security violation.
zh_cn: 由安全管理器抛出的异常，指示存在安全侵犯。

source: Thrown if an application attempts to access or modify a field, or to call a method that it does not have access to.
zh_cn: 当应用程序试图访问或修改它不能访问的字段，或调用它不能访问的方法时，抛出该错误。

source: Thrown if an application tries to access or modify a specified field of an object, and that object no longer has that field.
zh_cn: 如果应用程序试图访问或修改一个指定的对象字段，而该对象不再包含该字段时，抛出该错误。

source: Thrown if an application tries to call a specified method of a class (either static or instance), and that class no longer has a definition of that method.
zh_cn: 当应用程序试图调用类（静态或实例）的指定方法，而该类已不再具有该方法的定义时，抛出该错误。

source: Thrown if an application tries to create an array with negative size.
zh_cn: 如果应用程序试图创建大小为负的数组，则抛出该异常。
